{
    "posts": [
    {
        "title": "Chapter ? - Gitting There",
        "text": "Welcome to the first chapter of the rest of my life.  I'll admit, I'm a few chapters into my life story, but this seems like a great place to start.  I'm on a brand new adventure which includes a new city, new people and a new career!  
        
        For most of my life, I grew up in a small town in central Wisconsin.  I went to college in a small town in western Wisconsin.  After college, I moved to the great big city of Minneapolis.  That blew my mind, but what also blew my mind was there even more exotic places out there.  Shortly after college, my college roommate and I decided to take contorl of our lives and see what life was like oustide the Midwest.  We packed up our Wisconsin t-shirts and decor and moved down to Nashville, TN.  So exotic, I know, but to us it was.  It's a hot, hot place here in the middle of July, which happened to be when we moved.  Also, the world ends when it snows.  People say ya'll all the time and you find out you've been putting way too much effort into annunciating your words.  For me, Nashville was an opportunity for a brand new experience.  The small town feel in a big city excited me and I am all about the local business/artist scene.  
        
        Moving here did not disappoint, but I was well aware of the limited number of jobs for me as an Industrial Designer.  Still, I admired the city for all it was and knew everything would work out.  While considering my options I quickly became facinated by User Experience Design.  I couldn't believe I hadn't thought of it before.  It was everything I loved about design, just using a different medium.  Determined to pursue this further, I went out of my comfort zone and attended the Nashville User Experience Design meetup group.  It was there that I met local designers who were eager to point me in the direction of Nashville Software School.  Without hesitation, I applied and here I am, enrolled in the UX/UI Designer/Front-End Developer Bootcamp and the adventure starts NOW."
    }, 
    {
        "title": "Week 1 - Gitting Started",
        "text": "Our first week of UX Designer/Front-End Developer Bootcamp - Here's to a whole lot of firsts!  The first day of class, was full of meeting new people and becoming familiar with what will be my life the next six months.  With my Industrial Design background, the design aspect was very familiar to me, however the tech side was completely new.  What is a terminal?  What is GitHub? I barely know what HTML or CSS is.  And don't even get me started on Javascript.  Start small though!  Number one take away from this week, terminal isn't going to kill you." 
    }, 
    {
        "title": "Week 2 - Gitting Git",
        "text": "It's week 2, I now am Gitting GitHub.  And what... our first project already!  Even with a snow day set back, I'm excited to dig in and just whip up a website, right?  Wrong, I've found that I can prototype the simplest layout on Adobe XD, yet no matter how hard I try, I can't drag the boxes around on the screen when I'm coding.  So much frustration realizing that coding doesn't function like the Adobe Suite programs in any way!  And then there's github.  I get github, but i don't, but I do... definatley experiencing the roller coaster ride I was warned about.  On the bright side, I'm loving the correlation between Industrial Design and UX Design.  Developing personas and problem statements is nothing new to me."
        
    }, 
    {
        "title": "Week 3 - Gitting SNOW",
        "text": "Snow week, WTF Nashville shuts down!"
    }, 
    {
        "title": "week 4 - Gitting Style",
        "text": "It's week 3, Javascript time.  Just when I thought I was all caught up, NO.  Another group project.  The part of the project I focused on was the rebranding.  I enjoyed the project, in my comfort zone, I know, but I'll get there, give me time.   It taught me a lot of css and I am excited about both my knowledge in css and html, buttttt javascript can disappearn any day now.  and what is flexbox, I am all about the absolute positioning right now.  My struggles, billable hours.  Working in a way that is efficient to get quality results in tight time constraints." 
    }, 
    {
        "title": "week 5 - Gitting Style",
        "text": "I get flexbox.  amazing how when your forced to use something how easy it then comes.  Also anothere milestone was understanding functions in javascript.  We also were introduced to Sass and bootstrap."  
    }, 
    {
        "title": "week 6 - Gitting it Together",
        "text": "This week we learned a brand new task manager.  Grunt.  I'm not quite sure what it does.  As of right now, I just know you put a bunch of lines in your terminal and Magic.  Once correctly installed, you're able to more easily detect your errors and work in multiple javaScript files.  "  
    }, 
    {
        "title": "week 7 - Gitting Data",
        "text": "Time for our first javaScript heavy project.  I would be lying if I said I had any clue where to start.  For this project, we created a chat room.  It was important that we made an XHR call to get data of a conversation to display.  The other trick was figuring out how to write a message and have it display in the conversation.  Such simple tasks, so difficult to figure out."  
    }, 
    {
        "title": "week 8 Gitting Organized",
        "text": "Since we have more experience with XHR calls, we now are going to use them with multiple JSONs.  Our project of the week was to design a virtual theme park map.  This was the first project where we were able to combine our design and coding skilll to develop a product from start to finnish.  Designing with the user in mind and really understanding how to make a code plan were the top takeaways for this week!"  
    },
    {
        "title": "week 9 - Gitting CRUD",
        "text": "And we keep on moving forward.  We have been doing great, but all our of applications have been static so far.  Time to add some CRUD and make our pages even more interactive.  Time for firebase.  Even the thought of being able to send and edit information is so crazy to me!  I'm still not entirely sure how the flow works, but I'm learning from my classmates."  
    },
    {
        "title": "week 10 - Gitting APIs",
        "text": "With the introduction to firebase, we are able to utilize already existing databases.  APIs.  Our project this week required us to pull from multiple APIs.  Reading the documentation and learning how to implement the information was all a learning experience.  We also began to understand how to connect a user profile to our applications.  Using Google we were able to sign in and out of the application."  
    },
    {
        "title": "week 11 - Gitting Insight",
        "text": "Coming up with the idea for a capstone was difficult for me.  Luckily, I was able to count on my industrial design colleauges to help inspire me.  My friend suggested a collaborative playlist app which I was excited to move forward with.  I did my competitive research and found an opportunity gap.  I realized that there wasn't an easy way for users to create collaborate playlists that didn't require users to have the same music source and wasn't a paid feature.  This lead me to the YouTube API, an API that was free and gave you the option to make playlists free of charge as well.  After interviews, research, prototypes and user testing, I ended the week ready to code."  
    },
    {
        "title": "week 12 - Git R Done",
        "text": "Now that my app is designed, it's time to make it work!  Even from the very beginning I was falling into the pit of despair.  The constant battle of believing in yourself and believing in failure.  The more I coded though, the more I realized how much I learned and how much I actually know.  I took away two very important lessons from this project.  Number one, take everything step by step.  When you break everything down, what seems to be impossible becomes very possible and actually not that scary.  Number two, DON'T NEST YOUR CODE.  You will end up spending just as much time trying to unnest it as you did writing it.  And it will not be fun.  Despite my struggles, I was able to make a functioning app and would never have believed it three short months ago!"  
    },
    {
        "title": "week 13 - Git Away",
        "text": "Sometimes you just need to run away to Charleston for a week long break!"  
    },
    {
        "title": "week 14 - Gitting Compontents",
        "text": "After completing my first capstone, I felt I had a great understanding of javaScript.  So why not try something entirely new?  Time for React.  Learning a framework takes work, but doesn't seem as scary when you already have experience in learing a coding language.  The biggest step?  Learning what compotents are and what changing states means.  Just some small concepts I need to understand before becoming a React master.  No big deal."  
    },      
    {
        "title": "week 15 - Getting Experience",
        "text": "During this week, I participated in Nashville's Hack for the Community Hackathon.  Such a valueable experience considering I was able to collaborate with designers, developers to help create a project for the community.  My role was helping to create a page for an existing healthcare website.  This help to encourage not only donors, but patients as well to intereact with the website."  
    }  
]
}